dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/MATHACL_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="MATHACL" HW_revision="1.0">
    <group id="MATHACL_GPRCM" name="MATHACL_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="MATHACL_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="MATHACL_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="MATHACL_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
        </group>
    <register id="MATHACL_CTL" width="32" offset="0x1100" description="Control Register">
        <bitfield id="FUNC" description="ULP_ADCHP Enable Conversions." begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="NOP" value="0x0" description="No operation"/>
            <bitenum id="SINCOS" value="0x1" description="Sine and Cosine operation"/>
            <bitenum id="ATAN2" value="0x2" description="Arc tangent with x and y values as operands."/>
            <bitenum id="DIV" value="0x4" description="Divide, the operands are numerator, denominator, and the divide type. Result is the quotient and reminder."/>
            <bitenum id="SQRT" value="0x5" description="Do square root. Operand is the number whoose square root needs to be computed. The number if outside the range needs to be scaled up down by  2 power 2n to bring it with in the range."/>
            <bitenum id="MPY32" value="0x6" description="32-bit Multiply Result"/>
            <bitenum id="SQUARE32" value="0x7" description="32-bit square result"/>
            <bitenum id="MPY64" value="0x8" description="64-bit multiply result"/>
            <bitenum id="SQUARE64" value="0x9" description="64-bit multiply result"/>
            <bitenum id="MAC" value="0xA" description="Multiply and accumulate operation"/>
            <bitenum id="SAC" value="0xB" description="Square and accumulate operation"/>
        </bitfield>
        <bitfield id="QVAL" description="Indicates the fractional bits in the operands, ranges from 0 to 31. Applicable to DIV function." begin="12" end="8" width="5" rwaccess="R/W">
            <bitenum id="Q0" value="0x0" description="Q0 operands"/>
            <bitenum id="Q1" value="0x1" description="Q1 operands"/>
            <bitenum id="Q2" value="0x2" description="Q2 operands"/>
            <bitenum id="Q3" value="0x3" description="Q3 operands"/>
            <bitenum id="Q4" value="0x4" description="Q4 operands"/>
            <bitenum id="Q5" value="0x5" description="Q5 operands"/>
            <bitenum id="Q6" value="0x6" description="Q6 operands"/>
            <bitenum id="Q7" value="0x7" description="Q7 operands"/>
            <bitenum id="Q8" value="0x8" description="Q8 operands"/>
            <bitenum id="Q9" value="0x9" description="Q9 operands"/>
            <bitenum id="Q10" value="0xA" description="Q10 operands"/>
            <bitenum id="Q11" value="0xB" description="Q11 operands"/>
            <bitenum id="Q12" value="0xC" description="Q12 operands"/>
            <bitenum id="Q13" value="0xD" description="Q13 operands"/>
            <bitenum id="Q14" value="0xE" description="Q14 operands"/>
            <bitenum id="Q15" value="0xF" description="Q15 operands"/>
            <bitenum id="Q16" value="0x10" description="Q16 operands"/>
            <bitenum id="Q17" value="0x11" description="Q17 operands"/>
            <bitenum id="Q18" value="0x12" description="Q18 operands"/>
            <bitenum id="Q19" value="0x13" description="Q19 operands"/>
            <bitenum id="Q20" value="0x14" description="Q20 operands"/>
            <bitenum id="Q21" value="0x15" description="Q21 operands"/>
            <bitenum id="Q22" value="0x16" description="Q22 operands"/>
            <bitenum id="Q23" value="0x17" description="Q23 operands"/>
            <bitenum id="Q24" value="0x18" description="Q24 operands"/>
            <bitenum id="Q25" value="0x19" description="Q25 operands"/>
            <bitenum id="Q26" value="0x1A" description="Q26 operands"/>
            <bitenum id="Q27" value="0x1B" description="Q27 operands"/>
            <bitenum id="Q28" value="0x1C" description="Q28 operands"/>
            <bitenum id="Q29" value="0x1D" description="Q29 operands"/>
            <bitenum id="Q30" value="0x1E" description="Q30 operands"/>
            <bitenum id="Q31" value="0x1F" description="Q31 operands"/>
        </bitfield>
        <bitfield id="OPTYPE" description="Operand type, could signed or unsigned. applicable to DIV function." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="UNSIGNED" value="0x0" description="Unsigned operands"/>
            <bitenum id="SIGNED" value="0x1" description="Signed operands."/>
        </bitfield>
        <bitfield id="NUMITER" description="Number of iterations, applicable if the function does the computations iteratively, for example sine/cosine/atan2/sqrt.
Note: A value of 0 is interpreted as 31." begin="28" end="24" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="SFACTOR" description="Scaling factor. In case of SQRT function, the input operand needs to be in a range. If not it has to be scaled to 2^(+/-n). This field should be written with the value 'n'." begin="21" end="16" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="SATEN" description="Saturation enable
This bit is shared among DIV, SQUARE32, MPY32, MAC and SAC functions.
When enabled, it will make the result to saturate to maximum value in case of an overflow event
When disabled, the result will overflow to an unknown value." begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Saturation is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Saturation is enabled"/>
        </bitfield>
    </register>
    <register id="MATHACL_OP2" width="32" offset="0x1118" description="Operand 2 register.">
    </register>
    <register id="MATHACL_OP1" width="32" offset="0x111C" description="Operand 1 register.">
    </register>
    <register id="MATHACL_RES1" width="32" offset="0x1120" description="Result 1 register.">
    </register>
    <register id="MATHACL_RES2" width="32" offset="0x1124" description="Result 2 register.">
    </register>
    <register id="MATHACL_STATUS" width="32" offset="0x1130" description="Status Register">
        <bitfield id="UF" description="Underflow Flag" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="NO_UNDERFLOW" value="0x0" description="No undreflow error."/>
            <bitenum id="UNDERFLOW" value="0x1" description="Underflow error."/>
        </bitfield>
        <bitfield id="OVF" description="Overflow bit for MPY32, SQUARE32, DIV, MAC, and SAC functions
This bit will be set on overflow and will retain its value until cleared by writing 1 into CLR.CLR_OVF" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="NO_OVERFLOW" value="0x0" description="No overflow error."/>
            <bitenum id="OVERFLOW" value="0x0" description="Overflow error."/>
        </bitfield>
        <bitfield id="ERR" description="Incorrect inputs/outputs." begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="NOERROR" value="0x0" description="No Error in computation."/>
            <bitenum id="DIVBY0" value="0x1" description="DIVBY0 error"/>
        </bitfield>
        <bitfield id="BUSY" description="MATHACL busy bit." begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="DONE" value="0x0" description="Compute has completed."/>
            <bitenum id="NOTDONE" value="0x1" description="Compute ongoing"/>
        </bitfield>
    </register>
    <register id="MATHACL_STATUSCLR" width="32" offset="0x1140" description="Status flag clear register">
        <bitfield id="CLR_OVF" description="Write 1 to this bit to clear STATUS.OVF bit" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clear STATUS.OVF"/>
        </bitfield>
        <bitfield id="CLR_UF" description="Write 1 to this bit to clear STATUS.UF bit" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clear STATUS.UF"/>
        </bitfield>
        <bitfield id="CLR_ERR" description="Write 1 to this bit to clear STATUS.ERR field" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clear STATUS.ERR"/>
        </bitfield>
    </register>

</module>